<details ><summary>apply for staging 2025-04-03 09:18:18 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kahnwong/digger-demo#staging has been locked by PR #5
</details>

<details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # random_uuid.uuid will be created
  + resource "random_uuid" "uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_uuid   = (known after apply)
random_uuid.uuid: Creating...
random_uuid.uuid: Creation complete after 0s [id=12974704-675e-7104-7135-e24d2f418720]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

random_string = "fqu6Rd6XEPl59HbNUZE6JDFznnUi2Mp68334FLGZ"
random_uuid = "12974704-675e-7104-7135-e24d2f418720"

```
</details>

</details>